/*!
 * @brief	シンプルシェーダー。
 */

//定数バッファ
cbuffer VSCb : register( b0 ){
	float4x4 mWVP;		//ワールド・ビュー・プロジェクション行列。
};
//--------------------------------------------------------------------------------------
// 頂点シェーダーのエントリー関数。
//--------------------------------------------------------------------------------------
float4 VS( float4 Pos : POSITION ) : SV_POSITION
{
	//一気に座標変換する。
	float4 pos = mul( mWVP, Pos );
    return pos;
}
//--------------------------------------------------------------------------------------
// ピクセルシェーダーのエントリ関数。
//--------------------------------------------------------------------------------------
float4 PS( float4 pos : SV_POSITION ) : SV_Target
{
	float4 color = float4( 1.0f, 1.0f, 1.0f, 1.0f);
    return color; 
}
