/*!
 * @brief	シンプルシェーダー。
 */
cbuffer PSCb : register( b0 ){
	float4 mulColor;
	float4 addColor;
};

//--------------------------------------------------------------------------------------
// 頂点シェーダーのエントリー関数。
//--------------------------------------------------------------------------------------
float4 VS( float4 Pos : POSITION ) : SV_POSITION
{
	float4 pos = Pos;
    return pos;
}


//--------------------------------------------------------------------------------------
// ピクセルシェーダーのエントリ関数。
//--------------------------------------------------------------------------------------
float4 PS( float4 pos : SV_POSITION ) : SV_Target
{
	float4 color = float4( 1.0f, 1.0f, 1.0f, 1.0f);
	color *= mulColor;
	color += addColor;
    return color; 
}
